{
  "nodes": [
    {
      "op": "null", 
      "name": "img", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "attrs": {"axis": "(1, 2, 3)"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(128, 1, 1, 1)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub0", 
      "inputs": [[1, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv21_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv21_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv21_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn21_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn21_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu21_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv22_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv22_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv22_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn22_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn22_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[25, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu22_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv21_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv21_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv21_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn21_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn21_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu21_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv22_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv22_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv22_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn22_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn22_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[44, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu22_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv21_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv21_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv21_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn21_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn21_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn21_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu21_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv22_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv22_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv22_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn22_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn22_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn22_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[63, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu22_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv31_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv31_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv31_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn31_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn31_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu31_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv32_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv32_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv32_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn32_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn32_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "shortcut0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shortcut0_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "shortcut0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[65, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_sc0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_sc0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_sc0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_sc0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_sc0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 1], [89, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[82, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu32_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv31_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv31_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv31_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn31_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn31_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu31_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv32_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv32_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv32_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn32_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn32_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[109, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu32_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv31_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv31_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv31_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn31_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn31_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu31_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv32_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv32_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv32_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn32_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn32_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[128, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu32_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv31_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv31_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv31_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn31_3_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_3_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn31_3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn31_3", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu31_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv32_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv32_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv32_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn32_3_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_3_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn32_3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn32_3", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[147, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu32_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 1], [156, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "shortcut1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "shortcut1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "shortcut1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[149, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_sc0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_sc0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_sc0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_sc0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_sc0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[166, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0], [182, 0, 1], [183, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[188, 0, 0], [189, 0, 0], [190, 0, 0], [191, 0, 1], [192, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[193, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 1], [202, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0], [210, 0, 1], [211, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[212, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[214, 0, 0], [215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_3_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_3_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_3", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0], [220, 0, 1], [221, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[223, 0, 0], [224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_3_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_3_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_3", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[226, 0, 0], [227, 0, 0], [228, 0, 0], [229, 0, 1], [230, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[231, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[233, 0, 0], [234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_4_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_4_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_4", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[236, 0, 0], [237, 0, 0], [238, 0, 0], [239, 0, 1], [240, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[242, 0, 0], [243, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_4_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_4_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_4", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0], [248, 0, 1], [249, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[250, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41_5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[252, 0, 0], [253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn41_5_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_5_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn41_5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn41_5", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[255, 0, 0], [256, 0, 0], [257, 0, 0], [258, 0, 1], [259, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu41_5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42_5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[261, 0, 0], [262, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn42_5_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_5_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn42_5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn42_5", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[264, 0, 0], [265, 0, 0], [266, 0, 0], [267, 0, 1], [268, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[269, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu42_5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv51_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv51_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv51_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[271, 0, 0], [272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn51_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
